Repository: alifawzy22/fruit_ecommerce_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# OnBoardItem1Title
source: Welcome to
ar: مرحباً بك في

# OnBoardItem1SubTitle
source: Enjoy Shopping with FruitHUB. Explore Wide Variety of Fresh Fruits and get the best offers with high quality
ar: أكتشف تجربة تسوف فريدة مع FruitHUB. أستكشف مجموعتنا الواسعة من الفواكه الطازجة الممتازة وأحصل علي أفضل العروض والجودة العالية

# OnBoardItem2Title
source: Search and Shopping
ar: أبحث و تسوق

# OnBoardItem2SubTitle
source: We Provide you best carfully choosing fruits. Look on Details,Images and Evaluations to ensure from best choice
ar: نقدم لك أفضل الفواكه المختارة بعناية. أطلع علي التفاصيل والصور والتقييمات للتأكد من إختيار الفاكهة المثالية

# OnBoardStartButton
source: Start Now
ar: أبدأ الآن

# OnBoardNextStep
source: Skip
ar: تخط

# LoginViewTitle
source: Login
ar: تسجيل دخول

# AuthEmailAddressHint
source: Email Address
ar: البريد الإلكتروني

# AuthFullNameHint
source: Full Name
ar: الأسم كامل

# AuthPasswordHint
source: Password
ar: كلمة المرور

# AuthForgetPassword
source: Forget Password?
ar: نسيت كلمة المرور؟

# AuthDontHaveAccount
source: Don't Have an Account?
ar: لا تمتلك حساب؟

# AuthRegisterNow
source: Register Now
ar: قم بإنشاء حساب

source: OR
ar: أو

source: Login With {provider}
ar: تسجيل بواسطة {provider}

# RegisterViewTitle
source: Register
ar: حساب جديد

# RegisterViewTermsAndConditionsLabel
source: By creating an account, you agree to our
ar: من خلال إنشاء حساب ، فإنك توافق علي

# RegisterViewTermsAndConditions
source: terms and conditions.
ar: الشروط والأحكام الخاصة بنا.

# CreateNewAccount
source: Create Account
ar: إنشاء حساب جديد

# AuthHaveAccount
source: Have an Account?
ar: تمتلك حساب بالفعل؟

source: Google
ar: جوجل

source: Apple
ar: أبل

source: Facebook
ar: فيسبوك

# FireBaseWeakPassword
source: The password provided is too weak.
ar: كلمة المرور المدخلة ضعيفة.

# FireBaseEmailAlreadyInUse
source: The account already exists for that email.
ar: الحساب موجود بالفعل.

# FireBaseInvalidEmail
source: The email address is malformed or invalid.
ar: عنوان البريد الإلكتروني غير صحيح أو غير صالح.

# FireBaseOperationNotAllowed
source: The requested authentication operation (e.g., email/password sign-in) is not enabled in the Firebase Console.
ar: لم يتم تمكين عملية المصادقة المطلوبة (على سبيل المثال، تسجيل الدخول بالبريد الإلكتروني/كلمة المرور) في وحدة تحكم قاعدة البيانات.

# FireBaseTooManyRequests
source: Too many requests were made to the server. This is often due to repeated failed login attempts.
ar: تم إرسال عدد كبير جدًا من الطلبات إلى الخادم. غالبًا ما يكون ذلك بسبب محاولات تسجيل دخول فاشلة متكررة.

# FireBaseAccountExistWithDifferntCredential
source: An account already exists with the same email but different sign-in credentials.
ar: يوجد حساب موجود بالفعل بنفس البريد الإلكتروني ولكن بيانات تسجيل الدخول مختلفة.

# FireBaseCredentialAlreadyInUse
source: The credential is already associated with a different user account.
ar: تم ربط بيانات الاعتماد بالفعل بحساب مستخدم مختلف.

# FireBaseRequiresRecentLogin
source: The operation requires a recent login.
ar: تتطلب العملية تسجيل دخول حديث.

# FireBaseInvalidVerificationCode
source: The SMS verification code is invalid.
ar: رمز التحقق من الرسائل النصية القصيرة غير صالح.

# FireBaseInvalidVerificationID
source: The verification ID used for phone authentication is invalid.
ar: معرف التحقق المستخدم لمصادقة الهاتف غير صالح.

# FireBaseSessionExpired
source: The SMS code has expired.
ar: لقد انتهت صلاحية رمز الرسالة النصية القصيرة.

# FireBaseInvalidCredential
source: The credential is malformed or has expired.
ar: إن بيانات الاعتماد مشوهة أو منتهية الصلاحية.

# FireBaseUserMisMatch
source: The credential does not match the current user.
ar: لا تتطابق بيانات الاعتماد مع المستخدم الحالي.

# FireBaseNetworkRequestFailed
source: A network error occurred (e.g., no internet connection).
ar: حدث خطأ في الشبكة (على سبيل المثال، عدم وجود اتصال بالإنترنت).

# FireBaseEnternalError
source: An internal error occurred in the Firebase Authentication server.
ar: حدث خطأ داخلي في خادم مصادقة قاعدة البيانات.

# FireBaseAppNotAuthorized
source: The app is not authorized to use Firebase Authentication.
ar: لا يُسمح للتطبيق باستخدام مصادقة قاعدة البيانات.

# FireBaseUserDisabled
source: The userâ€™s account has been disabled by an administrator.
ar: لقد تم تعطيل حساب المستخدم من قبل المسؤول.

# FireBaseExpiredActionCode
source: The action code (e.g., password reset code) has expired.
ar: لقد انتهت صلاحية رمز الإجراء (على سبيل المثال، رمز إعادة تعيين كلمة المرور).

# FireBaseInvalidActionCode
source: The action code is invalid.
ar: كود الإجراء غير صالح.

# FireBaseMissingVerificationCode
source: The verification code is missing.
ar: رمز التحقق مفقود.

# FireBaseQuotaExceeded
source: The quota for the operation has been exceeded (e.g., too many SMS messages sent).
ar: تم تجاوز الحصة المخصصة للعملية (على سبيل المثال، تم إرسال عدد كبير جدًا من رسائل SMS).

# FireBaseUserNotFound
source: User Not Found
ar: المستخدم غير موجود

# FireBaseWrongPassword
source: Wrong Password
ar: كلمة المرور غير صحيحة

# FireBaseUnknownError
source: There is an error, please try later.
ar: حدث خطأ, برجاء المحاولة لاحقاً.

# requiredFiled
source: {name} is required.
ar: {name} يجب إدخالة.

# RegisterViewPleaseAcceptTermsAndConditions
source: Please accept terms and conditions.
ar: برجاء الموافقة علي الشروط والأحكام.

# AuthRegisterSuccessSnackBar
source: Create User Successfully
ar: تم إنشاء المستخدم بنجاح.

# AuthLoginSuccessSnackBar
source: Login Successfully
ar: تم تسجيل الدخول بنجاح.

source: Good Morning!..
ar: صباح الخير!..

# HintSearch
source: Search
ar: أبحث عن...

source: Eid Offers
ar: عروض العيد

# OffersDiscount
source: {discount}% OFF
ar: خصم {discount}%

source: Shopping Now
ar: تسوق الآن
